//===================================================
//
//授業その3[enemyHuman.cpp]
//Author:KishimotoEiji
//
//===================================================

//********************************
//インクルード
//********************************
#include "enemyHuman.h"

#include <stdio.h>
#include <stdlib.h>

//********************************
//静的メンバ変数
//********************************
int CEnemyHuman::m_nNumAll = 0;	//敵の総数

//===================================================
//総数を取得
//===================================================
int CEnemyHuman::GetNumAll()
{
	return m_nNumAll;
}

//===================================================
//コンストラクタ
//===================================================
CEnemyHuman::CEnemyHuman()
{
	//メンバ変数をクリア
	m_nSpeedWalk = 0;

	//数をカウントアップ
	m_nNumAll++;
}

//===================================================
//デストラクタ
//===================================================
CEnemyHuman::~CEnemyHuman()
{
	/* 処理無し */
}

//===================================================
//初期化
//===================================================
void CEnemyHuman::Init()
{
	//親クラスの初期化
	CEnemy::Init();

	//メンバ変数を初期化
	m_nSpeedWalk = 0;
}

//===================================================
//終了
//===================================================
void CEnemyHuman::Uninit()
{
	//親クラスの終了
	CEnemy::Uninit();
}

//===================================================
//入力
//===================================================
void CEnemyHuman::Input()
{
	//親クラスの入力
	CEnemy::Input();

	//入力
	printf(" 歩くスピード > ");
	scanf("%d", &m_nSpeedWalk);
}

//===================================================
//出力
//===================================================
void CEnemyHuman::Output()
{
	//親クラスの出力
	CEnemy::Output();

	//出力
	printf(" 歩くスピード : %d ]\n", m_nSpeedWalk);	//歩くスピード
}